vllm-ascend_adapt_const/gradient_results_adaptive/0034_E27_LongBench-QMSum-1K_high_poisson_7B_qps-auto-high_burst-1_seed-0_mb-adaptive/warmup_1.txt
INFO 07-31 19:04:02 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 07-31 19:04:02 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 07-31 19:04:02 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 07-31 19:04:02 [__init__.py:238] Platform plugin ascend is activated
2026-07-31 19:04:05,452 - 1870238 - ServiceProfiler - INFO - VLLM_USE_V1 not set, auto-detected via vLLM 0.20.2+empty: default 1
INFO 07-31 19:04:05 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 07-31 19:04:05 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
INFO 07-31 19:04:05 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
WARNING 07-31 19:04:05 [nixl_utils.py:34] NIXL is not available
WARNING 07-31 19:04:05 [nixl_utils.py:44] NIXL agent config is not available
WARNING 07-31 19:04:05 [registry.py:945] Model architecture DeepseekV4ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v4:AscendDeepseekV4ForCausalLM.
WARNING 07-31 19:04:05 [registry.py:945] Model architecture DeepSeekV4MTPModel is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v4_mtp:DeepSeekV4MTP.
INFO 07-31 19:04:05 [__init__.py:110] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
INFO 07-31 19:04:05 [__init__.py:110] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
WARNING 07-31 19:04:06 [__init__.py:87] The quantization method 'ascend' already exists and will be overwritten by the quantization config <class 'vllm_ascend._310p.quantization.modelslim_config.AscendModelSlimConfig310'>.
2026-07-31 19:04:06,761 - modelscope - INFO - Target directory already exists, skipping creation.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f7001127920>, trust_remote_code=False, seed=0, num_prompts=200, dataset_name='custom', no_stream=False, dataset_path='/workspace/DATASET/vllm_custom/longbench_qmsum_1K.jsonl', no_oversample=False, skip_chat_template=True, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=128, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen2.5-7B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=3.02755414, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, power_metrics_file=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-128f2be5-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Downloading Model from https://www.modelscope.cn to directory: /root/.cache/modelscope/hub/models/Qwen/Qwen2.5-7B
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 3.02755414
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [02:24<00:00,  1.39it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           3.03      
Benchmark duration (s):                  144.16    
Total input tokens:                      271519    
Total generated tokens:                  25600     
Request throughput (req/s):              1.39      
Output token throughput (tok/s):         177.58    
Peak output token throughput (tok/s):    800.00    
Peak concurrent requests:                200.00    
Total token throughput (tok/s):          2060.97   
---------------Time to First Token----------------
Mean TTFT (ms):                          24522.35  
Median TTFT (ms):                        26087.62  
P99 TTFT (ms):                           48898.16  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          631.73    
Median TPOT (ms):                        641.83    
P99 TPOT (ms):                           992.44    
---------------Inter-token Latency----------------
Mean ITL (ms):                           631.73    
Median ITL (ms):                         256.28    
P99 ITL (ms):                            1882.49   
==================================================
sys:1: DeprecationWarning: builtin type swigvarlink has no __module__ attribute